
## Terraform plan for environment: `int`

**Commit:** 1144f9f9352bd22d7020765ff5d210a4492bf3e3


**API version:** 418eb0c
**CLI version:** 418eb0c
**Selfserve version:** 418eb0c
**Internal version:** 418eb0c

### Plan summary

`23 to add, 0 to change, 0 to destroy`

**🆕 Creates**

```tf
module.service.aws_s3_bucket_policy.bucket_policy
module.service.module.cloudfront.aws_cloudfront_distribution.this[0]
module.service.module.cloudfront.aws_cloudfront_monitoring_subscription.this[0]
module.service.module.cloudfront.aws_cloudfront_origin_access_control.this["s3_oac_qa"]
module.service.module.ecs_service["api"].aws_appautoscaling_policy.this["cpu"]
module.service.module.ecs_service["api"].aws_appautoscaling_policy.this["memory"]
module.service.module.ecs_service["api"].aws_appautoscaling_target.this[0]
module.service.module.ecs_service["api"].aws_ecs_service.this[0]
module.service.module.ecs_service["api"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].aws_appautoscaling_policy.this["cpu"]
module.service.module.ecs_service["internal"].aws_appautoscaling_policy.this["memory"]
module.service.module.ecs_service["internal"].aws_appautoscaling_target.this[0]
module.service.module.ecs_service["internal"].aws_ecs_service.this[0]
module.service.module.ecs_service["internal"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].aws_appautoscaling_policy.this["cpu"]
module.service.module.ecs_service["selfserve"].aws_appautoscaling_policy.this["memory"]
module.service.module.ecs_service["selfserve"].aws_appautoscaling_target.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_task_definition.this[0]
module.service.module.records.aws_route53_record.this["cdn A"]
module.service.module.ecs_service["api"].module.container_definition["api"].aws_cloudwatch_log_group.this[0]
module.service.module.ecs_service["internal"].module.container_definition["internal"].aws_cloudwatch_log_group.this[0]
module.service.module.ecs_service["selfserve"].module.container_definition["selfserve"].aws_cloudwatch_log_group.this[0]
```
**📖 Reads**

```tf
module.service.data.aws_iam_policy_document.s3_policy
module.service.module.ecs_service["api"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].data.aws_ecs_task_definition.this[0]
```


----

<details data-gh-workflow="int-environment-plan"><summary>Show full plan</summary>

```tf


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.service.module.acm.aws_acm_certificate.this[0] has changed
  ~ resource "aws_acm_certificate" "this" {
        id                        = "arn:aws:acm:us-east-1:054614622558:certificate/099135b7-9801-4bc5-be75-e44ba35acb89"
      ~ status                    = "PENDING_VALIDATION" -> "ISSUED"
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.service.data.aws_iam_policy_document.s3_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::vol-app-assets/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.service.aws_s3_bucket_policy.bucket_policy will be created
  + resource "aws_s3_bucket_policy" "bucket_policy" {
      + bucket = "vol-app-assets"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.service.module.cloudfront.aws_cloudfront_distribution.this[0] will be created
  + resource "aws_cloudfront_distribution" "this" {
      + aliases                         = [
          + "cdn.qa.olcs.dev-dvsacloud.uk",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2and3"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods            = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cache_policy_id            = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = false
          + default_ttl                = (known after apply)
          + max_ttl                    = (known after apply)
          + min_ttl                    = 0
          + origin_request_policy_id   = "acba4595-bd28-49b8-b9fe-13317c0390fa"
          + response_headers_policy_id = "60669652-455b-4ae9-85a4-c4c02393f86c"
          + target_origin_id           = "s3_oac_qa"
          + trusted_key_groups         = (known after apply)
          + trusted_signers            = (known after apply)
          + viewer_protocol_policy     = "allow-all"
        }

      + logging_config {
          + bucket          = "vol-app-qa-assets-logs.s3.amazonaws.com"
          + include_cookies = false
          + prefix          = "cloudfront"
        }

      + ordered_cache_behavior {
          + allowed_methods            = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cache_policy_id            = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = false
          + default_ttl                = (known after apply)
          + max_ttl                    = (known after apply)
          + min_ttl                    = 0
          + origin_request_policy_id   = "acba4595-bd28-49b8-b9fe-13317c0390fa"
          + path_pattern               = "/*"
          + response_headers_policy_id = "eaab4381-ed33-4a86-88ca-d9558dc6cd63"
          + target_origin_id           = "s3_oac_qa"
          + viewer_protocol_policy     = "redirect-to-https"

          + function_association {
              + event_type   = "viewer-request"
              + function_arn = "arn:aws:cloudfront::054614622558:function/qa-legacy-assets-rewrite-uri"
            }
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "vol-app-assets.s3.eu-west-1.amazonaws.com"
          + origin_access_control_id = (known after apply)
          + origin_id                = "s3_oac_qa"
          + origin_path              = "/8c2320a"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:054614622558:certificate/099135b7-9801-4bc5-be75-e44ba35acb89"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.service.module.cloudfront.aws_cloudfront_monitoring_subscription.this[0] will be created
  + resource "aws_cloudfront_monitoring_subscription" "this" {
      + distribution_id = (known after apply)
      + id              = (known after apply)

      + monitoring_subscription {
          + realtime_metrics_subscription_config {
              + realtime_metrics_subscription_status = "Enabled"
            }
        }
    }

  # module.service.module.cloudfront.aws_cloudfront_origin_access_control.this["s3_oac_qa"] will be created
  + resource "aws_cloudfront_origin_access_control" "this" {
      + description                       = "CloudFront qa access to S3"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "s3_oac_qa"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # module.service.module.ecs_service["api"].data.aws_ecs_task_definition.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "vol-app-qa-api-service"
      + task_role_arn        = (known after apply)
    }

  # module.service.module.ecs_service["api"].aws_appautoscaling_policy.this["cpu"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/vol-app-qa-api-cluster/vol-app-qa-api-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.service.module.ecs_service["api"].aws_appautoscaling_policy.this["memory"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/vol-app-qa-api-cluster/vol-app-qa-api-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.service.module.ecs_service["api"].aws_appautoscaling_target.this[0] will be created
  + resource "aws_appautoscaling_target" "this" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 1
      + resource_id        = "service/vol-app-qa-api-cluster/vol-app-qa-api-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.module.ecs_service["api"].aws_ecs_service.this[0] will be created
  + resource "aws_ecs_service" "this" {
      + cluster                            = "arn:aws:ecs:eu-west-1:054614622558:cluster/vol-app-qa-api-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 66
      + desired_count                      = 1
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = true
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "vol-app-qa-api-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = true

      + load_balancer {
          + container_name   = "api"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:054614622558:targetgroup/vol-app-qa-api-tg/4ad150e01a8157e4"
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-2f750f4b",
            ]
          + subnets          = [
              + "subnet-0339697ab1fb15608",
              + "subnet-03ab7dcb40693fa6b",
              + "subnet-0c32775e41e574819",
            ]
        }

      + timeouts {}
    }

  # module.service.module.ecs_service["api"].aws_ecs_task_definition.this[0] will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + Command                = null
                  + Cpu                    = 1024
                  + CredentialSpecs        = null
                  + DependsOn              = null
                  + DisableNetworking      = null
                  + DnsSearchDomains       = null
                  + DnsServers             = null
                  + DockerLabels           = null
                  + DockerSecurityOptions  = null
                  + EntryPoint             = null
                  + Environment            = [
                      + {
                          + Name  = "APP_VERSION"
                          + Value = "418eb0c"
                        },
                      + {
                          + Name  = "ENVIRONMENT_NAME"
                          + Value = "qa"
                        },
                    ]
                  + EnvironmentFiles       = null
                  + Essential              = true
                  + ExtraHosts             = null
                  + FirelensConfiguration  = null
                  + HealthCheck            = null
                  + Hostname               = null
                  + Image                  = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/api:418eb0c"
                  + Interactive            = false
                  + Links                  = null
                  + LinuxParameters        = {
                      + Capabilities       = null
                      + Devices            = null
                      + InitProcessEnabled = true
                      + MaxSwap            = null
                      + SharedMemorySize   = null
                      + Swappiness         = null
                      + Tmpfs              = null
                    }
                  + LogConfiguration       = {
                      + LogDriver     = "awslogs"
                      + Options       = {
                          + awslogs-group         = "/aws/ecs/vol-app-qa-api-service/api"
                          + awslogs-region        = "eu-west-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                      + SecretOptions = null
                    }
                  + Memory                 = 4096
                  + MemoryReservation      = 100
                  + MountPoints            = []
                  + Name                   = "api"
                  + PortMappings           = [
                      + {
                          + AppProtocol        = ""
                          + ContainerPort      = 8080
                          + ContainerPortRange = null
                          + HostPort           = 8080
                          + Name               = "http"
                          + Protocol           = "tcp"
                        },
                    ]
                  + Privileged             = false
                  + PseudoTerminal         = false
                  + ReadonlyRootFilesystem = false
                  + RepositoryCredentials  = null
                  + ResourceRequirements   = null
                  + Secrets                = null
                  + StartTimeout           = 30
                  + StopTimeout            = 120
                  + SystemControls         = []
                  + Ulimits                = null
                  + User                   = null
                  + VolumesFrom            = []
                  + WorkingDirectory       = null
                },
            ]
        )
      + cpu                      = "1024"
      + execution_role_arn       = "arn:aws:iam::054614622558:role/vol-app-qa-api-service-20240805162358379100000010"
      + family                   = "vol-app-qa-api-service"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + task_role_arn            = "arn:aws:iam::054614622558:role/vol-app-qa-api-service-2024080516235832250000000d"
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "ARM64"
          + operating_system_family = "LINUX"
        }
    }

  # module.service.module.ecs_service["internal"].data.aws_ecs_task_definition.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "vol-app-qa-internal-service"
      + task_role_arn        = (known after apply)
    }

  # module.service.module.ecs_service["internal"].aws_appautoscaling_policy.this["cpu"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/vol-app-qa-internal-cluster/vol-app-qa-internal-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.service.module.ecs_service["internal"].aws_appautoscaling_policy.this["memory"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/vol-app-qa-internal-cluster/vol-app-qa-internal-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.service.module.ecs_service["internal"].aws_appautoscaling_target.this[0] will be created
  + resource "aws_appautoscaling_target" "this" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 1
      + resource_id        = "service/vol-app-qa-internal-cluster/vol-app-qa-internal-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.module.ecs_service["internal"].aws_ecs_service.this[0] will be created
  + resource "aws_ecs_service" "this" {
      + cluster                            = "arn:aws:ecs:eu-west-1:054614622558:cluster/vol-app-qa-internal-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 66
      + desired_count                      = 1
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = true
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "vol-app-qa-internal-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = true

      + load_balancer {
          + container_name   = "internal"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:054614622558:targetgroup/vol-app-qa-internal-tg/f6f7409064eb47b6"
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-5e611b3a",
            ]
          + subnets          = [
              + "subnet-03eced6018a020336",
              + "subnet-0c5f932f45d70a12b",
              + "subnet-0d81153ada587e3c5",
            ]
        }

      + timeouts {}
    }

  # module.service.module.ecs_service["internal"].aws_ecs_task_definition.this[0] will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + execution_role_arn       = "arn:aws:iam::054614622558:role/vol-app-qa-internal-service-20240805162358404900000011"
      + family                   = "vol-app-qa-internal-service"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + task_role_arn            = "arn:aws:iam::054614622558:role/vol-app-qa-internal-service-2024080516235832440000000e"
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "ARM64"
          + operating_system_family = "LINUX"
        }
    }

  # module.service.module.ecs_service["selfserve"].data.aws_ecs_task_definition.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "vol-app-qa-selfserve-service"
      + task_role_arn        = (known after apply)
    }

  # module.service.module.ecs_service["selfserve"].aws_appautoscaling_policy.this["cpu"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/vol-app-qa-selfserve-cluster/vol-app-qa-selfserve-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.service.module.ecs_service["selfserve"].aws_appautoscaling_policy.this["memory"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/vol-app-qa-selfserve-cluster/vol-app-qa-selfserve-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.service.module.ecs_service["selfserve"].aws_appautoscaling_target.this[0] will be created
  + resource "aws_appautoscaling_target" "this" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 1
      + resource_id        = "service/vol-app-qa-selfserve-cluster/vol-app-qa-selfserve-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0] will be created
  + resource "aws_ecs_service" "this" {
      + cluster                            = "arn:aws:ecs:eu-west-1:054614622558:cluster/vol-app-qa-selfserve-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 66
      + desired_count                      = 1
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = true
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "vol-app-qa-selfserve-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = true

      + load_balancer {
          + container_name   = "selfserve"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:054614622558:targetgroup/vol-app-qa-selfserve-tg/a1fac1d596cd4d07"
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-bd5e24d9",
            ]
          + subnets          = [
              + "subnet-0513b83a83db8d743",
              + "subnet-0a4536d63bcdc01b7",
              + "subnet-0e3ddc5719a56284f",
            ]
        }

      + timeouts {}
    }

  # module.service.module.ecs_service["selfserve"].aws_ecs_task_definition.this[0] will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + execution_role_arn       = "arn:aws:iam::054614622558:role/vol-app-qa-selfserve-service-2024080516235835370000000f"
      + family                   = "vol-app-qa-selfserve-service"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + task_role_arn            = "arn:aws:iam::054614622558:role/vol-app-qa-selfserve-service-2024080516235817160000000c"
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "ARM64"
          + operating_system_family = "LINUX"
        }
    }

  # module.service.module.records.aws_route53_record.this["cdn A"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = false
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "cdn.qa.olcs.dev-dvsacloud.uk"
      + type            = "A"
      + zone_id         = "Z0166940UDRFAPSBXLNO"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.service.module.ecs_service["api"].module.container_definition["api"].aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/vol-app-qa-api-service/api"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.module.ecs_service["internal"].module.container_definition["internal"].aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/vol-app-qa-internal-service/internal"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.module.ecs_service["selfserve"].module.container_definition["selfserve"].aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/vol-app-qa-selfserve-service/selfserve"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

Plan: 23 to add, 0 to change, 0 to destroy.

```

</details>